//SAMPLE JOB(TESTJCL,XXXXXX),CLASS=A,MSGCLASS=C
//STEP1    EXEC    PGM=CADUP001
//CADUPENT DD DISP=SHR,DSN=CADUPENT
//CADUPCOR DD DSN=CADUPCOR,
//         DISP=(,CATLG,DELETE),
//         UNIT=(DISCO),
//         SPACE=(TRK,(03000,0400),RLSE),
//         DCB=(,LRECL=71,RECFM=F)
//CADUPHIS DD DSN=CADUPHIS,
//         DISP=(,CATLG,DELETE),
//         UNIT=(DISCO),
//         SPACE=(TRK,(03000,0400),RLSE),
//         DCB=(,LRECL=71,RECFM=F)