//SAMPLE JOB(TESTJCL,XXXXXX),CLASS=A,MSGCLASS=C
//STEP1    EXEC    PGM=CADUP001
//ARQRANGE DD DISP=SHR,DSN=ARQRANGE
//RNGECORR DD DSN=RNGECORR,
//         DISP=(,CATLG,DELETE),
//         UNIT=(DISCO),
//         SPACE=(TRK,(03000,0400),RLSE),
//         DCB=(,LRECL=71,RECFM=F)
//RNGEHIST DD DSN=RNGEHIST,
//         DISP=(,CATLG,DELETE),
//         UNIT=(DISCO),
//         SPACE=(TRK,(03000,0400),RLSE),
//         DCB=(,LRECL=71,RECFM=F)